__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoder_input (InputLayer)      (None, 1024, 2)      0                                            
__________________________________________________________________________________________________
conv1d_247 (Conv1D)             (None, 1024, 64)     960         encoder_input[0][0]              
__________________________________________________________________________________________________
max_pooling1d_111 (MaxPooling1D (None, 512, 64)      0           conv1d_247[0][0]                 
__________________________________________________________________________________________________
conv1d_248 (Conv1D)             (None, 512, 32)      14368       max_pooling1d_111[0][0]          
__________________________________________________________________________________________________
max_pooling1d_112 (MaxPooling1D (None, 256, 32)      0           conv1d_248[0][0]                 
__________________________________________________________________________________________________
conv1d_249 (Conv1D)             (None, 256, 16)      3600        max_pooling1d_112[0][0]          
__________________________________________________________________________________________________
max_pooling1d_113 (MaxPooling1D (None, 128, 16)      0           conv1d_249[0][0]                 
__________________________________________________________________________________________________
conv1d_250 (Conv1D)             (None, 128, 8)       904         max_pooling1d_113[0][0]          
__________________________________________________________________________________________________
max_pooling1d_114 (MaxPooling1D (None, 64, 8)        0           conv1d_250[0][0]                 
__________________________________________________________________________________________________
flatten_27 (Flatten)            (None, 512)          0           max_pooling1d_114[0][0]          
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 2)            1026        flatten_27[0][0]                 
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 2)            1026        flatten_27[0][0]                 
__________________________________________________________________________________________________
z (Lambda)                      (None, 2)            0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 21,884
Trainable params: 21,884
Non-trainable params: 0
__________________________________________________________________________________________________
None
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
z_sampling (InputLayer)      (None, 2)                 0         
_________________________________________________________________
Dense_after_sampling (Dense) (None, 512)               1536      
_________________________________________________________________
reshape_27 (Reshape)         (None, 64, 8)             0         
_________________________________________________________________
conv1d_251 (Conv1D)          (None, 64, 8)             456       
_________________________________________________________________
up_sampling1d_111 (UpSamplin (None, 128, 8)            0         
_________________________________________________________________
conv1d_252 (Conv1D)          (None, 128, 16)           912       
_________________________________________________________________
up_sampling1d_112 (UpSamplin (None, 256, 16)           0         
_________________________________________________________________
conv1d_253 (Conv1D)          (None, 256, 32)           3616      
_________________________________________________________________
up_sampling1d_113 (UpSamplin (None, 512, 32)           0         
_________________________________________________________________
conv1d_254 (Conv1D)          (None, 512, 64)           14400     
_________________________________________________________________
up_sampling1d_114 (UpSamplin (None, 1024, 64)          0         
_________________________________________________________________
conv1d_255 (Conv1D)          (None, 1024, 2)           898       
=================================================================
Total params: 21,818
Trainable params: 21,818
Non-trainable params: 0
_________________________________________________________________
None
